package com.example.user.history;


public class QuestionLibrary {

    private String mQuestions [] = {
            "Лесю Українку називають",
            "НОбраз Сізіфової праці наявний у рядках",
            "У поезії є всі символічні образи, ОКРІМ",
            "Вкажіть правильні твердження",
            "НОлександр Олесь є автором рядків",
            " Вийму, вийму! Візьму собі твою співочу душу, а серденько словами зачарую..., — звертається до коханого головна героїня твору",

            "Словами Стояла я і слухала весну  починається",
            "Драма - феєрія \"Лісова пісня\"",
            "\" З-над хмар і з долин \" - це",
            "Особливий вплив на формування світогляду М.Вороного справила творчість...",
            "Після поразки УНР М.Вороний...",
            "Першим надрукованим твором поета є вірш...",



            "Першим надрукованим твором поета є вірш..."


    };


    private String mChoices [][] = {
            {"гірською орлицею", "дівчиною з легенди", "дочкою Прометея"},
            {"Ні, я хочу крізь сльози сміятись", "Я на вбогім сумнім перелозі", "В довгу, темную нічку невидну"},
            {"зірки провідної", "нічки невидної", "гори крем'яної"},
            {"Нова драма поєднала риси реалізму, натуралізму й символізму", "У новій драмі важлива роль належала вчинкам героїв, а не внутрішнім конфліктам", "Друкованим органом Молодої музи був журнал Світ"},
            {"Лови летючу мить життя!", "А наді мною Революція в червоній заграві пливла.", "І схочеш ти вернуть собі, як Фауст,дні минулі..."},
            {"Миколи Вороного", "Івана Франка", "Лесі Українки"},

            {"Драма - феєрія \"Лісова пісня\"", "Вірш Миколи Вороного", "Вірш Миколи Вороного"},
            {"Лесі Українки", "Івана Франка", "Олександра Олеся"},
            {"Літературно-художній альманах", "Львівська літературна група", ""},
            {"Лесі Українки", "Т.Шевченка", "В.Винниченка"},
            {"присвятив себе сім'ї", "емігрував за кордон", "займався лише творчістю"},
            {"Інфанта", "Блакитна Панна", "Не журись, дівчино"},



            {"Інфанта", "Блакитна Панна", "Не журись, дівчино"}
    };



    private String mCorrectAnswers[] = {
            "дочкою Прометея",
            "В довгу, темную нічку невидну",
            "нічки невидної",
            "Нова драма поєднала риси реалізму, натуралізму й символізму",
            "І схочеш ти вернуть собі, як Фауст,дні минулі...",
            "Володимира Винниченка",

            "Вірш Миколи Вороного",
            "Лесі Українки",
            "Львівська літературна група",
            "В.Винниченка",
            "займався лише творчістю",
            "Блакитна Панна",






            "Блакитна Панна"};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
