package com.example.user.history;


public class QuestionLibrary_2 {

    private String mQuestions [] = {
            "Ольга Кобилянська народилася",
            "Перші літературні спроби Ольги Кобилянської написані",
            "емою твору «Impromtu phantasie» є",
            "Головна героїня твору «Valse melancoligue» мріяла бути",
            "Яке враження справила на дівчат Софія Дорошенко?",
            " Яку жахливу звістку отримала Софія від дядька?",

            "Який засіб використала письменниця, описуючи Софію Дорошенко: «Була дуже мила в обходженні, легка, ледве замітна собою, але мовчалива і дуже поважна»?",
            "Що стало причиною смерті Софії?",
            "Василь Стефаник народився",
            "Оскільки праця зігнула Івана Дідуха в дугу, то в селі його називали",
            "У творі «Камінний хрест» письменник зображує еміграцію українців",
            "Розлогий опис праці головного героя Івана Дідуха на своїй ниві – це",




            "Розлогий опис праці головного героя Івана Дідуха на своїй ниві – це",


    };


    private String mChoices [][] = {
            {"на Галичині", "на Лемківщині", "на Волині"},
            {"польською мовою", "німецькою мовою", "українською мовою"},
            {"змалювання життя трьох обдарованих жінок", "показ долі правдошукача-бунтаря", "митець і суспільство"},
            {"вчителькою", "лікарем", "музикантом"},
            {"були неприємно вражені", "свідомо ігнорували", "були зачаровані її грою"},
            {"що дуже захворів", "що купив для неї будинок", "що її залишив наречений"},

            {"метафору", "гіперболу", "порівняння"},
            {"запалення легенів", "струс мозку", "серцевий удар"},
            {"у селі Русові Снятинського повіту Івано-Франківської області", "на хуторі Кривенькому поблизу Кригульця на Поділлі", "у Вінниці"},
            {"Переломаний", "Каліка", "Зігнутий"},
            {"1990-х років", "між Першою і Другою світовими війнами у ХХ ст.", "наприкінці Другої світової війни"},
            {"розв'язка", "експозиція новели", "зав’язка новели"},



            {"розв'язка", "експозиція новели", "зав’язка новели"},
    };



    private String mCorrectAnswers[] = {
            "на Волині",
            "польською мовою",
            "показ долі правдошукача-бунтаря",
            "вчителькою",
            "були зачаровані її грою",
            "що її залишив наречений",

            "порівняння",
            "запалення легенів",
            "у селі Русові Снятинського повіту Івано-Франківської області",
            "Зігнутий",
            "наприкінці Другої світової війни",
            "експозиція новели",





            "експозиція новели"};




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
